{
    "greeting": {
        "morning": "Bom dia! ",
        "afternoon": "Boa tarde! ",
        "night": "Boa noite! "
    },
    "welcome": "Seja bem-vindo!",
    "nav": {
        "home": "Início",
        "about": "Sobre mim",
        "projects": "Projetos",
        "contact": "Contato"
    },
    "intro": {
        "title": "Seu próximo desenvolvedor",
        "spantitle": "Fullstack", 
        "subtitle": "Olá! Eu sou o Daniel Bueno, tenho 17 anos, sou desenvolvedor Fullstack"
    },
    "about": {
        "title": "Sobre mim",
        "paragraph": {
            "text1": "Meu nome é Daniel Bueno. Sou apaixonado por tecnologia desde pequeno. Comecei a desenvolver e programar em 2022, me apaixonei completamente pela programação e, desde então, tenho buscado aprimorar me constantemente. Sendo assim, me candidatei ao processo seletivo para ingressar na Etec Jaraguá, no curso de Desenvolvimento de Sistemas com Ensino Médio, e, felizmente, fui aprovado em segundo lugar.",
            "text2": "Atualmente, estou no 3º ano do ensino médio na Etec Jaraguá. Faço projetos com ReactJS, NodeJS, NextJS, dentre outras tecnologias, e desejo explorar novas linguagens, ferramentas e frameworks. Pretendo me candidatar a vagas de estágio para adquirir experiência profissional, pois ainda não trabalhei na área.",
            "text3": "Gosto de aprender coisas novas para aplicar em meus projetos e sempre reservo uma parte do meu dia para estudar desenvolvimento por conta própria. Além da tecnologia, amo treinar musculação, lutar Muay Thai, andar de bicicleta, acampar, escutar música, ir à igreja e acompanhar meus dividendos caindo na conta."
        },
        "buttonlabel": "Tecnologias",
        "tooltip": {
            "studying": "Estudando",
            "intermediateknowledge": "Conhecimento intermediário",
            "solidknowledge": "Conhecimento sólido"
        },
        "imgalt": "foto de perfil"
    },
    "projects": {
        "title": "Meus projetos",
        "ds": {
            "text": "Veja tudo sobre o curso de desenvolvimento de sistemas!",
            "about": "Desenvolvido em parceria com dois amigos da escola, com o objetivo de promover nosso curso e ampliar nossa visibilidade, essa ideia foi sugerida por um professor, e nós decidimos assumir a responsabilidade pelo projeto. Este foi meu primeiro projeto em desenvolvimento com ReactJS!"
        },
        "short": {
            "text": "Saiba o conteúdo do vídeo sem sequer entrar nele.",
            "about": "O Short Summary permite ao usuário visualizar um resumo do vídeo sem precisar assisti-lo, utilizando inteligência artificial para extrair o texto e criar o resumo. Essa foi minha primeira experiência com Express, a qual me proporcionou muitos aprendizados sobre NodeJS."
        },
        "age": {
            "text": "Veja sua idade precisamente!",
            "about": "O Age Calculator é uma aplicação web que permite ao usuário calcular sua idade em anos, meses e dias. Este projeto me permitiu aprender muito sobre a manipulação de datas em JavaScript, além de melhorar minhas habilidades com forms no HTML e CSS."
        },
        "ticket": {
            "text": "Gere seu ticket do evento Coding Conf!",
            "about": "O Ticket Generator é uma aplicação web que permite ao usuário gerar seu ticket para o evento Coding Conf (fictício). Neste projeto aprendi manipulação de formulários, validação de dados com o Zod + React Hook Form, e enviar emails automaticamente com o EmailJs, além de me aprofundar um pouco mais em Next.js."
        },
        "notes": {
            "text": "Faça as suas anotações do dia a dia!",
            "about": "O Notes é uma aplicação web que permite ao usuário fazer anotações do cotidiano, podendo salvar, editar e excluir as anotações. Este projeto me permitimiu me aprofundar um pouco mais em programação Fullstack com Express.js e MongoDB."
        },
        "moreprojects": "Mais projetos",
        "fewerprojects": "Menos projetos"
    },
    "card": {
        "seemore": "Ver mais",
        "imgalt": "Ícone do projeto",
        "openwebsite": "Abrir site",
        "repository": "Repositório",
        "close": "Fechar"
    },
    "contact": "Contato",
    "month": {
        "january": "Janeiro",
        "february": "Fevereiro",
        "march": "Março",
        "april": "Abril",
        "may": "Maio",
        "june": "Junho",
        "july": "Julho",
        "august": "Agosto",
        "september": "Setembro",
        "october": "Outubro",
        "november": "Novembro",
        "december": "Dezembro"
    }
}